# Ширина экрана
SCREEN_WIDTH = 300
# Высота экрана
SCREEN_HEIGHT = 600
# Размер ячейки сетки
GRID_SIZE = 30
# Количество столбцов в сетке
COLUMNS = SCREEN_WIDTH // GRID_SIZE
# Количество строк в сетке
ROWS = SCREEN_HEIGHT // GRID_SIZE
# Частота обновления кадров
FPS = 60



# ЦВЕТА
# Чёрный цвет
BLACK = (0, 0, 0)
# Серый цвет для рисования сетки
GREY = (128, 128, 128)
COLORS = [
    # Жёлтого школьного автобуса
    "#ffd800",
    # Люминесцентный ярко-оранжевый
    "#ffa420",
    # Лесной зелёный
    "#228b22",
    # Алый
    "#cc1b00",
    # Фиолетовый
    "#4f0070",
    # Голубой
    "#007cdb",
    # Формы морских офицеров
    "#000080"
]

SHAPES = {
    "I": [
        [(0, 1), (1, 1), (2, 1), (3, 1)],
        # Поворот 0 для фигуры I
        [(2, 0), (2, 1), (2, 2), (2, 3)]
        # Поворот 1 для фигуры I
    ],
    "O": [
        [(1, 0), (2, 0), (1, 1), (2, 1)]
        # Поворот 0 для фигуры O
    ],
    "T": [
        [(1, 0), (0, 1), (1, 1), (2, 1)],
        # Поворот 0 для фигуры T
        [(1, 0), (0, 1), (1, 1), (1, 2)],
        # Поворот 1 для фигуры T
        [(0, 1), (1, 1), (2, 1), (1, 2)],
        # Поворот 2 для фигуры T
        [(1, 0), (1, 1), (1, 2), (2, 1)]
        # Поворот 3 для фигуры T
    ],
    "S": [
        [(1, 0), (2, 0), (0, 1), (1, 1)],
        # Поворот 0 для фигуры S
        [(0, 0), (0, 1), (1, 1), (1, 2)]
        # Поворот 1 для фигуры S
    ],
    "Z": [
        [(0, 0), (1, 0), (1, 1), (2, 1)],
        # Поворот 0 для фигуры Z
        [(1, 0), (0, 1), (1, 1), (0, 2)]
        # Поворот 1 для фигуры Z
    ],
    "J": [
        [(0, 0), (0, 1), (1, 1), (2, 1)],
        # Поворот 0 для фигуры J
        [(0, 0), (1, 0), (0, 1), (0, 2)],
        # Поворот 1 для фигуры J
        [(0, 0), (1, 0), (2, 0), (2, 1)],
        # Поворот 2 для фигуры J
        [(0, 2), (1, 0), (1, 1), (1, 2)]
        # Поворот 3 для фигуры J
    ],
    "L": [
        [(2, 0), (0, 1), (1, 1), (2, 1)],
        # Поворот 0 для фигуры L
        [(0, 0), (0, 1), (0, 2), (1, 2)],
        # Поворот 1 для фигуры L
        [(0, 0), (1, 0), (2, 0), (0, 1)],
        # Поворот 2 для фигуры L
        [(0, 0), (1, 0), (1, 1), (1, 2)]
        # Поворот 3 для фигуры L
    ]
}